package chap01

/**


1.2 정적타입 지정 언어
 정적 타입 지정의 장점 => 성능, 신뢰성, 유지보수성, 도구지원
 val x =1 형태의 타입 유추도 지원


 함수형 프로그래밍에서 얻을 수 있는 두번째 유익
 다중 스레드를 사용해도 안전하다.

 함수형 프로그래밍은 테스트 하기 쉽다

 코틀린에서의 지원
 - 함수 타입을 지원함에 따라 어떤 함수가 다른 함수를 파라미터로 받거나 함수가 새로운 함수를 반환할 수 있다.
 - 람다 식을 지원함에 따라 번거로운 준비 코드를 작성하지 않아도 코드블록을 쉽게 정의하고 여기저기 전달가능
 - 데이터 클래스는 불변적인 값 객체를 간편하게 만들수 있는 구문 제공
 - 코틀린 표준 라이브러리는 객체와 컬렉션을 함수형 스타일로 다룰 수 있는 API를 제공

1.3 코틀린 응용
 1.3.1 코틀린 서버 프로그래밍
 1.3.2 코틀린 안드로이드 프로그래밍

1.4 코틀린의 철학
 1.4.1 실용성
 1.4.2 간결성
 1.4.3 안전성 : 널세이프, 타입캐스팅
 1.4.4 상호운용성 : 자바와 섞여있어도 프로그래밍 컴파일 가능

1.5 코틀린 도구 사용
 1.5.1 코틀린 코드 컴파일
 1.5.2 인텔리제이 아이디어와 안드로이드 스튜디오의 코틀린
 1.5.3 대화형 셀
 1.5.4 이클립스 플러그인
 1.5.5 온라인 놀이터
 1.5.6 자바 코틀린 변환기

1.6 요약

**/